#!/usr/bin/env python
#-*- coding: utf-8 -*-
#=============================================================================
#     FileName:
#         Desc:
#       Author: 白开水
#        Email: vekergu@163.com
#     HomePage: https://github.com/vekergu
#      Version: 0.0.1
#   LastChange: 
#      History:
#=============================================================================
from __future__ import print_function

#强内聚 松耦合

#依赖倒转原则
#高层模块不应该依赖底层模块。两个都应该依赖抽象
#抽象不应该依赖细节 细节应该带依赖抽象

#白话  针对接口编程 不要对实现编程

#李氏代换原则
#子类型必须能替换掉他们的父类型

#抽象类的存在 则是为了 高层类 与 底层类 的一个中间节点
#这样当底层类 被替换 不会影响到高层类，是为了解耦




